---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeNumberOfIntermediateSupports
source: html/c35cfaae-a89a-60df-6303-7075be954030.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeNumberOfIntermediateSupports Property

"Middle Support Number": Number of intermediate supports

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeNumberOfIntermediateSupports { get; }
```